---战斗相关数据
local FightCache = class("FightCache",base.BaseCache)
local FightTestData = require("game.cache.FightTestData")

function FightCache:init()
    self._fightData = {}  --战斗数据
    self._fightType = 0  --0其他战斗，1副本数据，2竞技场数据，3爬塔， 4公会副本
    self.curFightId = 0  --当前战斗id
    self.curFightName = ""  --当前战斗名字
    self.curFightPower = 0  --当前战斗对象的战力
    self.curFightSex = 0   --当前战斗对象的性别
    self.curFightIndex = 0  --当前竞技场挑战目标位置
    self.curFightRank = 0  --当前战斗排名
    self.canJump = false  --标志是否可以跳过
    self.fightState = 0  --升级延迟开关|1-副本、2-竞技场
    self.fightLevelUp = 0
    self.fightLevelParams = nil
    self.isFightPlot = false  --标志是否弹对话
    self.isClickFight = false  --是否已经点击战斗|禁用一切
    
    self.data = FightTestData.gebulin11
    --self:newerGuideFightData()
end

function FightCache:setData( data_, type_ )
    self._fightData = data_
    self._fightType = type_
end

function FightCache:getData()
    return self._fightData
end
function FightCache:getType()
    return self._fightType
end

function FightCache:getFightReport()
    return self._fightData.fightReport or self.data
end

function FightCache:newerGuideFightData()
    local data = {
        ["targetArmy"]={{["index"]=21,["mid"]=631701601,["maxHp"]=1690,["maxMp"]=4},--//机械邪龙兽            /////////////////////////////////////基础信息
            {["index"]=22,["mid"]=631701602,["maxHp"]=4500,["maxMp"]=4},--//木偶兽
            {["index"]=23,["mid"]=631701603,["maxHp"]=1600,["maxMp"]=4},--//钢铁海龙兽
            {["index"]=25,["mid"]=631701604,["maxHp"]=10000,["maxMp"]=4}},--//小丑皇
        --["selfArmy"]={{["index"]=11,["mid"]=631500301,["maxHp"]=500,["maxMp"]=4},--//亚古兽
           
            --{["index"]=12,["mid"]=631500101,["maxHp"]=500,["maxMp"]=4},--//加布兽
           
            --{["index"]=13,["mid"]=631501301,["maxHp"]=500,["maxMp"]=4}},--//巴达兽
			["selfArmy"]={},
           
        ["bouts"] = {      
              [1] = {                                                                                --/////////////////////////////////////主角说话
                ["atk"] = 11,
                ["bout"] = 1,
                ["skillId"] = 403122,
                ["buff_add"] = {},  --获得buff [概率触发]
                ["buff_hurt"] = {},   --buff伤害
                ["guide"] = {1918,1904},  --1901表示换模型， 1902表示剧情对话， 1903表示添加特效 （配置表Y-引导）
                ["targets"] = {  --（配置表ID命名规则）401伤害   406暴击 407闪避 408怒气 409加血 410加暴击血
                   
                }
            },       
                --[2] = {                                                                                --/////////////////////////////////////小丑皇说话
                --["atk"] = 25,
                --["bout"] = 1,
                --["skillId"] = 403122,
                --["buff_add"] = {},  --获得buff [概率触发]
                --["buff_hurt"] = {},   --buff伤害
                --["guide"] = {1905},  --1901表示换模型， 1902表示剧情对话， 1903表示添加特效 （配置表Y-引导）
                --["targets"] = {  --（配置表ID命名规则）401伤害   406暴击 407闪避 408怒气 409加血 410加暴击血
                   
                --}
           -- },      			
                 [2] = {                                                                                --/////////////////////////////////////我方1出现
                ["atk"] = 11,
                ["bout"] = 1,
                ["skillId"] = 403122,
                ["buff_add"] = {},  --获得buff [概率触发]
                ["buff_hurt"] = {},   --buff伤害
                ["guide"] = {1906},  --1901表示换模型， 1902表示剧情对话， 1903表示添加特效 （配置表Y-引导）
                ["targets"] = {  --（配置表ID命名规则）401伤害   406暴击 407闪避 408怒气 409加血 410加暴击血
                    
                }
            },      		
			     [3] = {                                                                                --/////////////////////////////////////我方2出现
                ["atk"] = 13,
                ["bout"] = 1,
                ["skillId"] = 403122,
                ["buff_add"] = {},  --获得buff [概率触发]
                ["buff_hurt"] = {},   --buff伤害
                ["guide"] = {1907},  --1901表示换模型， 1902表示剧情对话， 1903表示添加特效 （配置表Y-引导）
                ["targets"] = {  --（配置表ID命名规则）401伤害   406暴击 407闪避 408怒气 409加血 410加暴击血
                  
                }
            },      		
				[4] = {                                                                                --/////////////////////////////////////我方3出现
                ["atk"] = 15,
                ["bout"] = 1,
                ["skillId"] = 403122,
                ["buff_add"] = {},  --获得buff [概率触发]
                ["buff_hurt"] = {},   --buff伤害
                ["guide"] = {1908},  --1901表示换模型， 1902表示剧情对话， 1903表示添加特效 （配置表Y-引导）
                ["targets"] = {  --（配置表ID命名规则）401伤害   406暴击 407闪避 408怒气 409加血 410加暴击血
                   
                }
            },   
               	[5] = {                                                                                --/////////////////////////////////////亚古兽说话
                ["atk"] = 16,
                ["bout"] = 1,
                ["skillId"] = 403122,
                ["buff_add"] = {},  --获得buff [概率触发]
                ["buff_hurt"] = {},   --buff伤害
                ["guide"] = {1909},  --1901表示换模型， 1902表示剧情对话， 1903表示添加特效 （配置表Y-引导）
                ["targets"] = {  --（配置表ID命名规则）401伤害   406暴击 407闪避 408怒气 409加血 410加暴击血
                  
                }
            },      			
				
                                                          		--/////////////////////////////////////我方1号位出手
            [6] = {
                ["atk"] = 11,
                ["bout"] = 1,
                ["skillId"] = 403122,
                ["buff_add"] = {},  --获得buff [概率触发]
                ["buff_hurt"] = {},   --buff伤害
                ["guide"] = {},  --1901表示换模型， 1902表示剧情对话， 1903表示添加特效 （配置表Y-引导）
                ["targets"] = {  --（配置表ID命名规则）401伤害   406暴击 407闪避 408怒气 409加血 410加暴击血
                    {["tar"]=21,["hurts"]={["401"]=190},["buff"]={}},  
                     {["tar"]=22,["hurts"]={["401"]=190},["buff"]={}},
                      {["tar"]=23,["hurts"]={["401"]=211},["buff"]={}},--//受击对象
                }
            },                                                    
            [7] = {
                ["atk"] = 21,                                                        --/////////////////////////////////敌方1号位出手
                ["skillId"] = 403753,  
                ["targets"] = {
                    {["tar"]=11,["hurts"]={["401"]=690},["buff"]={}},
                    {["tar"]=13,["hurts"]={["401"]=681},["buff"]={}},
                    {["tar"]=15,["hurts"]={["401"]=650},["buff"]={}},       --//多个目标
                }
            },
           
       
            [8] = {                                                                --/////////////////////////敌方2号位置出手
                ["atk"] = 22,
                ["skillId"] = 403135,
                ["targets"] = {
                    {["tar"]=11,["hurts"]={["401"]=500},["buff"]={}},
                    {["tar"]=13,["hurts"]={["401"]=510},["buff"]={}},
                    {["tar"]=15,["hurts"]={["401"]=530},["buff"]={}},
                }
            },     
             [9] = {
                ["atk"] = 13,                                                          --/////////////////我方3号位置出手
                ["skillId"] = 403102,
                ["targets"] = {
                    {["tar"]=22,["hurts"]={["401"]=255},["buff"]={}},
                    {["tar"]=25,["hurts"]={["401"]=291},["buff"]={}},
                }
            },                                            

			
                                                                --///////////////////////////// 敌方3号位置出手
            [10] = {
                ["atk"] = 23,
                ["skillId"] = 403102,
                ["targets"] = {
                    {["tar"]=11,["hurts"]={["401"]=1511},["buff"]={}},           
                }
            },
			                                                               --//////////////////////////// 我方5号位置出手
			     [11] = {
                ["atk"] = 15,   
                ["skillId"] = 403222,
                ["targets"] = {
                    {["tar"]=25,["hurts"]={["401"]=600},["buff"]={}},
                }
            },        
          
		  	--[12] = {                                                                                --/////////////////////////////////////小丑皇说话
                --["atk"] = 15,
                --["bout"] = 1,
                --["skillId"] = 403122,
                --["buff_add"] = {},  --获得buff [概率触发]
                --["buff_hurt"] = {},   --buff伤害
                --["guide"] = {1910}},  --1901表示换模型， 1902表示剧情对话， 1903表示添加特效 （配置表Y-引导）
                --["targets"] = {  --（配置表ID命名规则）401伤害   406暴击 407闪避 408怒气 409加血 410加暴击血
                  
               -- }
          --  },  
           [12] = {                                                             --////////////////////////////敌方5号位置出手
                ["atk"] = 25,
                ["skillId"] = 403455,
				["guide"] = {1910}, 
                ["targets"] = {
                    {["tar"]=11,["hurts"]={["406"]=1210},["buff"]={}}, 
                    {["tar"]=13,["hurts"]={["406"]=1402},["buff"]={}}, 
                    {["tar"]=15,["hurts"]={["406"]=1309},["buff"]={}},         
                }
				},
            
		
			--[13] = {                                                                                --/////////////////////////////////////主角说话
                --["atk"] = 15,
                --["bout"] = 1,
                --["skillId"] = 403122,
                --["buff_add"] = {},  --获得buff [概率触发]
                --["buff_hurt"] = {},   --buff伤害
                --["guide"] = {1911},  --1901表示换模型， 1902表示剧情对话， 1903表示添加特效 （配置表Y-引导）
                --["targets"] = {  --（配置表ID命名规则）401伤害   406暴击 407闪避 408怒气 409加血 410加暴击血
                 
                --}
            --},  
			
			
			
            [13] = {                                           ----------------------1号进化，攻击
                ["atk"] = 11,
                ["bout"] = 1,
                ["skillId"] = 403125,
                ["buff_add"] = {},  --获得buff [概率触发]
                ["buff_hurt"] = {},   --buff伤害
                ["guide"] = {1912,1919,1901},  --1901表示换模型， 1902表示剧情对话， 1903表示添加特效 （配置表Y-引导）
                ["targets"] = {  --（配置表ID命名规则）401-401伤害   406暴击 407闪避 408怒气 409加血 410加暴击血
                    {["tar"]=21,["hurts"]={["401"]=1500},["buff"]={}},
                    {["tar"]=22,["hurts"]={["401"]=1550},["buff"]={}},
                    {["tar"]=23,["hurts"]={["401"]=1480},["buff"]={}},--//受击对象
                }
            },  
            [14] = {                                         ---------------------2号进化，攻击
                ["atk"] = 13,
                ["bout"] = 1,
                ["skillId"] = 403105,
                ["buff_add"] = {},  --获得buff [概率触发]
                ["buff_hurt"] = {},   --buff伤害
                ["guide"] = {1913,1920,1902},  --1901表示换模型， 1902表示剧情对话， 1903表示添加特效 （配置表Y-引导）
                ["targets"] = {  --（配置表ID命名规则）401-401伤害   406暴击 407闪避 408怒气 409加血 410加暴击血
                    {["tar"]=22,["hurts"]={["401"]=2538},["buff"]={}},
                    {["tar"]=25,["hurts"]={["401"]=2610},["buff"]={}},--//受击对象
                }
            },  
            [15] = {                                             ---------------------3号进化，攻击
                ["atk"] = 15,
                ["bout"] = 1,
                ["skillId"] = 403225,
                ["buff_add"] = {},  --获得buff [概率触发]
                ["buff_hurt"] = {},   --buff伤害
                ["guide"] = {1914,1921,1903},  --1901表示换模型， 1902表示剧情对话， 1903表示添加特效 （配置表Y-引导）
                ["targets"] = {  --（配置表ID命名规则）401-401伤害   406暴击 407闪避 408怒气 409加血 410加暴击血
                    {["tar"]=25,["hurts"]={["401"]=6999},["buff"]={}},--//受击对象
                }
            },    	
         
		   [16] = {                                                                                --/////////////////////////////////////小丑皇说话
                ["atk"] = 15,
                ["bout"] = 1,
                ["skillId"] = 403122,
                ["buff_add"] = {},  --获得buff [概率触发]
                ["buff_hurt"] = {},   --buff伤害
                ["guide"] = {1915},  --1901表示换模型， 1902表示剧情对话， 1903表示添加特效 （配置表Y-引导）
                ["targets"] = {  --（配置表ID命名规则）401伤害   406暴击 407闪避 408怒气 409加血 410加暴击血
                 
                }
            },  
		 -- [19] = {                                                                                --/////////////////////////////////////花仙兽说话
               -- ["atk"] = 15,
                --["bout"] = 1,
               -- ["skillId"] = 403122,
               -- ["buff_add"] = {},  --获得buff [概率触发]
               -- ["buff_hurt"] = {},   --buff伤害
               -- ["guide"] = {1916},  --1901表示换模型， 1902表示剧情对话， 1903表示添加特效 （配置表Y-引导）
               -- ["targets"] = {  --（配置表ID命名规则）401伤害   406暴击 407闪避 408怒气 409加血 410加暴击血
                 
              --  }
           -- },  
		
		-- [20] = {                                                                                --/////////////////////////////////////主角说话
              --  ["atk"] = 15,
              --  ["bout"] = 1,
               -- ["skillId"] = 403122,
               -- ["buff_add"] = {},  --获得buff [概率触发]
               -- ["buff_hurt"] = {},   --buff伤害
               -- ["guide"] = {1917},  --1901表示换模型， 1902表示剧情对话， 1903表示添加特效 （配置表Y-引导）
               -- ["targets"] = {  --（配置表ID命名规则）401伤害   406暴击 407闪避 408怒气 409加血 410加暴击血
               
                --}
            --},  
		  
			}
        }
	
	self.data = data
	self._fightType = 0
    return data
end

return FightCache